In [1]:
import pandas as pd

In [2]:
s = pd.Series(['banana', 42])

In [3]:
s

0    banana
1        42
dtype: object

In [4]:
s = pd.Series(['Wes', 'Creator'],
              index=['Person', 'Who'])

In [5]:
s

Person        Wes
Who       Creator
dtype: object

In [7]:
s.loc['Person']

'Wes'

In [10]:
scientist = pd.DataFrame({
    'Name': ['Franklin', 'Gosset'],
    'job': ['chem', 'stats']
})

In [11]:
scientist

       Name    job
0  Franklin   chem
1    Gosset  stats

In [13]:
scientist = pd.DataFrame({
    'Name': ['Franklin', 'Gosset'],
    'job': ['chem', 'stats']
    },
    columns=['job', 'Name']
)
scientist

     job      Name
0   chem  Franklin
1  stats    Gosset

In [15]:
scientist = pd.DataFrame({
    'Name': ['Franklin', 'Gosset'],
    'job': ['chem', 'stats']
    },
    index=['Franklin', 'Gosset'],
    columns=['job', 'Name']
)
scientist

            job      Name
Franklin   chem  Franklin
Gosset    stats    Gosset

In [27]:
scientists = pd.read_csv('C:/Users/Danie/Desktop/2018-10-python1/data/scientists.csv')

In [18]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [21]:
type(scientists['Age'])

pandas.core.series.Series

In [22]:
scientists['Age'].mean()

59.125

In [23]:
scientists['Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [25]:
scientists['Age'] + scientists['Age']

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [33]:
scientists['Age'] = scientists['Age'] * 2

In [34]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16  148             Chemist
1        William Gosset  1876-06-13  1937-10-16  244        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13  360               Nurse
3           Marie Curie  1867-11-07  1934-07-04  264             Chemist
4         Rachel Carson  1907-05-27  1964-04-14  224           Biologist
5             John Snow  1813-03-15  1858-06-16  180           Physician
6           Alan Turing  1912-06-23  1954-06-07  164  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23  308       Mathematician

In [39]:
scientists['Age_doubled'] = scientists['Age'] * 2

In [40]:
scientists

,Name,Born,Died,Age,Occupation,Age_doubled
0,Rosaline Franklin,1920-07-25,1958-04-16,148,Chemist,296
1,William Gosset,1876-06-13,1937-10-16,244,Statistician,488
2,Florence Nightingale,1820-05-12,1910-08-13,360,Nurse,720
3,Marie Curie,1867-11-07,1934-07-04,264,Chemist,528
4,Rachel Carson,1907-05-27,1964-04-14,224,Biologist,448
5,John Snow,1813-03-15,1858-06-16,180,Physician,360
6,Alan Turing,1912-06-23,1954-06-07,164,Computer Scientist,328
7,Johann Gauss,1777-04-30,1855-02-23,308,Mathematician,616

In [45]:
sci_mean = scientists['Age'].mean()
scientists.loc[scientists['Age'] > sci_mean]

,Name,Born,Died,Age,Occupation,Age_doubled
1,William Gosset,1876-06-13,1937-10-16,244,Statistician,488
2,Florence Nightingale,1820-05-12,1910-08-13,360,Nurse,720
3,Marie Curie,1867-11-07,1934-07-04,264,Chemist,528
7,Johann Gauss,1777-04-30,1855-02-23,308,Mathematician,616

In [43]:
scientists['Age'].mean()

236.5

In [44]:
scientists['Age'] > scientists['Age'].mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [49]:
scientists

,Name,Born,Died,Age,Occupation,Age_doubled
0,Rosaline Franklin,1920-07-25,1958-04-16,148,Chemist,296
1,William Gosset,1876-06-13,1937-10-16,244,Statistician,488
2,Florence Nightingale,1820-05-12,1910-08-13,360,Nurse,720
3,Marie Curie,1867-11-07,1934-07-04,264,Chemist,528
4,Rachel Carson,1907-05-27,1964-04-14,224,Biologist,448
5,John Snow,1813-03-15,1858-06-16,180,Physician,360
6,Alan Turing,1912-06-23,1954-06-07,164,Computer Scientist,328
7,Johann Gauss,1777-04-30,1855-02-23,308,Mathematician,616

In [51]:
scientists['died_dt'] = pd.to_datetime(scientists['Died'], format='%Y-%m-%d')

In [55]:
scientists

,Name,Born,Died,Age,Occupation,Age_doubled,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,148,Chemist,296,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,244,Statistician,488,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,360,Nurse,720,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,264,Chemist,528,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,224,Biologist,448,1964-04-14
5,John Snow,1813-03-15,1858-06-16,180,Physician,360,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,164,Computer Scientist,328,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,308,Mathematician,616,1855-02-23

In [61]:
scientists['born_dt'] = pd.to_datetime(scientists['Born'], format='%Y-%m-%d')

In [62]:
scientists

,Name,Born,Died,Age,Occupation,Age_doubled,died_dt,born_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,148,Chemist,296,1958-04-16,1920-07-25
1,William Gosset,1876-06-13,1937-10-16,244,Statistician,488,1937-10-16,1876-06-13
2,Florence Nightingale,1820-05-12,1910-08-13,360,Nurse,720,1910-08-13,1820-05-12
3,Marie Curie,1867-11-07,1934-07-04,264,Chemist,528,1934-07-04,1867-11-07
4,Rachel Carson,1907-05-27,1964-04-14,224,Biologist,448,1964-04-14,1907-05-27
5,John Snow,1813-03-15,1858-06-16,180,Physician,360,1858-06-16,1813-03-15
6,Alan Turing,1912-06-23,1954-06-07,164,Computer Scientist,328,1954-06-07,1912-06-23
7,Johann Gauss,1777-04-30,1855-02-23,308,Mathematician,616,1855-02-23,1777-04-30

In [84]:
dt = scientists.died_dt - scientists.born_dt